ua1arn/hftrx/src/sdram/stm32mp1/stm32mp1_ddr_base.c
	/* PORT 1 */
	uint32_t pcfgr_1;	/* 0x4b4 Configuration Read */
	uint32_t pcfgw_1;	/* 0x4b8 Configuration Write */
	uint8_t reserved4bc[0x540 - 0x4bc];
	uint32_t pctrl_1;	/* 0x540 Port 2 Control Register */
	uint32_t pcfgqos0_1;	/* 0x544 Read QoS Configuration 0 */
	uint32_t pcfgqos1_1;	/* 0x548 Read QoS Configuration 1 */
	uint32_t pcfgwqos0_1;	/* 0x54c Write QoS Configuration 0 */
	uint32_t pcfgwqos1_1;	/* 0x550 Write QoS Configuration 1 */
};

/* DDR Physical Interface Control (DDRPHYC) registers*/
struct stm32mp1_ddrphy {
	uint32_t ridr;		/* 0x00 R Revision Identification */
	uint32_t pir;		/* 0x04 R/W PHY Initialization */
	uint32_t pgcr;		/* 0x08 R/W PHY General Configuration */
	uint32_t pgsr;		/* 0x0C PHY General Status */
	uint32_t dllgcr;	/* 0x10 R/W DLL General Control */
	uint32_t acdllcr;	/* 0x14 R/W AC DLL Control */
	uint32_t ptr0;		/* 0x18 R/W PHY Timing 0 */
	uint32_t ptr1;		/* 0x1C R/W PHY Timing 1 */
	uint32_t ptr2;		/* 0x20 R/W PHY Timing 2 */
	uint32_t aciocr;	/* 0x24 AC I/O Configuration */
	uint32_t dxccr;		/* 0x28 DATX8 Common Configuration */
	uint32_t dsgcr;		/* 0x2C DDR System General Configuration */
	uint32_t dcr;		/* 0x30 DRAM Configuration */
	uint32_t dtpr0;		/* 0x34 DRAM Timing Parameters0 */
	uint32_t dtpr1;		/* 0x38 DRAM Timing Parameters1 */
	uint32_t dtpr2;		/* 0x3C DRAM Timing Parameters2 */
	uint32_t mr0;		/* 0x40 Mode 0 */
	uint32_t mr1;		/* 0x44 Mode 1 */
	uint32_t mr2;		/* 0x48 Mode 2 */
	uint32_t mr3;		/* 0x4C Mode 3 */
	uint32_t odtcr;		/* 0x50 ODT Configuration */
	uint32_t dtar;		/* 0x54 data training address */
	uint32_t dtdr0;		/* 0x58 */
	uint32_t dtdr1;		/* 0x5c */
	uint8_t res1[0x0c0 - 0x060];	/* 0x60 */
	uint32_t dcuar;		/* 0xc0 Address */
	uint32_t dcudr;		/* 0xc4 DCU Data */
	uint32_t dcurr;		/* 0xc8 DCU Run */
	uint32_t dculr;		/* 0xcc DCU Loop */
	uint32_t dcugcr;	/* 0xd0 DCU General Configuration */
	uint32_t dcutpr;	/* 0xd4 DCU Timing Parameters */
	uint32_t dcusr0;	/* 0xd8 DCU Status 0 */
	uint32_t dcusr1;	/* 0xdc DCU Status 1 */
	uint8_t res2[0x100 - 0xe0];	/* 0xe0 */
	uint32_t bistrr;	/* 0x100 BIST Run */
	uint32_t bistmskr0;	/* 0x104 BIST Mask 0 */
	uint32_t bistmskr1;	/* 0x108 BIST Mask 0 */
	uint32_t bistwcr;	/* 0x10c BIST Word Count */
	uint32_t bistlsr;	/* 0x110 BIST LFSR Seed */
	uint32_t bistar0;	/* 0x114 BIST Address 0 */
	uint32_t bistar1;	/* 0x118 BIST Address 1 */
	uint32_t bistar2;	/* 0x11c BIST Address 2 */
	uint32_t bistupdr;	/* 0x120 BIST User Data Pattern */
	uint32_t bistgsr;	/* 0x124 BIST General Status */
	uint32_t bistwer;	/* 0x128 BIST Word Error */
	uint32_t bistber0;	/* 0x12c BIST Bit Error 0 */
	uint32_t bistber1;	/* 0x130 BIST Bit Error 1 */
	uint32_t bistber2;	/* 0x134 BIST Bit Error 2 */
	uint32_t bistwcsr;	/* 0x138 BIST Word Count Status */
	uint32_t bistfwr0;	/* 0x13c BIST Fail Word 0 */
	uint32_t bistfwr1;	/* 0x140 BIST Fail Word 1 */
	uint8_t res3[0x178 - 0x144];	/* 0x144 */
	uint32_t gpr0;		/* 0x178 General Purpose 0 (GPR0) */
	uint32_t gpr1;		/* 0x17C General Purpose 1 (GPR1) */
	uint32_t zq0cr0;	/* 0x180 zq 0 control 0 */
	uint32_t zq0cr1;	/* 0x184 zq 0 control 1 */
	uint32_t zq0sr0;	/* 0x188 zq 0 status 0 */
	uint32_t zq0sr1;	/* 0x18C zq 0 status 1 */
	uint8_t res4[0x1C0 - 0x190];	/* 0x190 */
	uint32_t dx0gcr;	/* 0x1c0 Byte lane 0 General Configuration */
	uint32_t dx0gsr0;	/* 0x1c4 Byte lane 0 General Status 0 */
	uint32_t dx0gsr1;	/* 0x1c8 Byte lane 0 General Status 1 */
	uint32_t dx0dllcr;	/* 0x1cc Byte lane 0 DLL Control */
	uint32_t dx0dqtr;	/* 0x1d0 Byte lane 0 DQ Timing */
	uint32_t dx0dqstr;	/* 0x1d4 Byte lane 0 DQS Timing */
	uint8_t res5[0x200 - 0x1d8];	/* 0x1d8 */
	uint32_t dx1gcr;	/* 0x200 Byte lane 1 General Configuration */
	uint32_t dx1gsr0;	/* 0x204 Byte lane 1 General Status 0 */
	uint32_t dx1gsr1;	/* 0x208 Byte lane 1 General Status 1 */
	uint32_t dx1dllcr;	/* 0x20c Byte lane 1 DLL Control */
	uint32_t dx1dqtr;	/* 0x210 Byte lane 1 DQ Timing */
	uint32_t dx1dqstr;	/* 0x214 Byte lane 1 QS Timing */
	uint8_t res6[0x240 - 0x218];	/* 0x218 */
	uint32_t dx2gcr;	/* 0x240 Byte lane 2 General Configuration */
	uint32_t dx2gsr0;	/* 0x244 Byte lane 2 General Status 0 */
	uint32_t dx2gsr1;	/* 0x248 Byte lane 2 General Status 1 */
	uint32_t dx2dllcr;	/* 0x24c Byte lane 2 DLL Control */
	uint32_t dx2dqtr;	/* 0x250 Byte lane 2 DQ Timing */
	uint32_t dx2dqstr;	/* 0x254 Byte lane 2 QS Timing */
	uint8_t res7[0x280 - 0x258];	/* 0x258 */
	uint32_t dx3gcr;	/* 0x280 Byte lane 3 General Configuration */
	uint32_t dx3gsr0;	/* 0x284 Byte lane 3 General Status 0 */
	uint32_t dx3gsr1;	/* 0x288 Byte lane 3 General Status 1 */
	uint32_t dx3dllcr;	/* 0x28c Byte lane 3 DLL Control */
	uint32_t dx3dqtr;	/* 0x290 Byte lane 3 DQ Timing */
	uint32_t dx3dqstr;	/* 0x294 Byte lane 3 QS Timing */
};

struct stm32mp1_ddr_size {
	uint64_t base;
	uint64_t size;
};

/**
 * struct ddr_info
 *
 * @dev: pointer for the device
 * @info: UCLASS RAM information
 * @ctl: DDR controleur base address
 * @phy: DDR PHY base address
 * @syscfg: syscfg base address
 */
struct ddr_info {
	struct stm32mp1_ddr_size info;
	struct stm32mp1_ddrctl *ctl;
	struct stm32mp1_ddrphy *phy;
	uintptr_t pwr;
	uintptr_t rcc;
};
//
//struct stm32mp1_ddrctrl_reg {
//	uint32_t mstr;
//	uint32_t mrctrl0;
//	uint32_t mrctrl1;
//	uint32_t derateen;
//	uint32_t derateint;
//	uint32_t pwrctl;
//	uint32_t pwrtmg;
//	uint32_t hwlpctl;
//	uint32_t rfshctl0;
//	uint32_t rfshctl3;
//	uint32_t crcparctl0;
//	uint32_t zqctl0;
//	uint32_t dfitmg0;
//	uint32_t dfitmg1;
//	uint32_t dfilpcfg0;
//	uint32_t dfiupd0;
//	uint32_t dfiupd1;
//	uint32_t dfiupd2;
//	uint32_t dfiphymstr;
//	uint32_t odtmap;
//	uint32_t dbg0;
//	uint32_t dbg1;
//	uint32_t dbgcmd;
//	uint32_t poisoncfg;
//	uint32_t pccfg;
//};
//
//struct stm32mp1_ddrctrl_timing {
//	uint32_t rfshtmg;
//	uint32_t dramtmg0;
//	uint32_t dramtmg1;
//	uint32_t dramtmg2;
//	uint32_t dramtmg3;
//	uint32_t dramtmg4;
//	uint32_t dramtmg5;
//	uint32_t dramtmg6;
//	uint32_t dramtmg7;
//	uint32_t dramtmg8;
//	uint32_t dramtmg14;
//	uint32_t odtcfg;
//};
//
//struct stm32mp1_ddrctrl_map {
//	uint32_t addrmap1;
//	uint32_t addrmap2;
//	uint32_t addrmap3;
//	uint32_t addrmap4;
//	uint32_t addrmap5;
//	uint32_t addrmap6;
//	uint32_t addrmap9;
//	uint32_t addrmap10;
//	uint32_t addrmap11;
//};
//
//struct stm32mp1_ddrctrl_perf {
//	uint32_t sched;
//	uint32_t sched1;
//	uint32_t perfhpr1;
//	uint32_t perflpr1;
//	uint32_t perfwr1;
//	uint32_t pcfgr_0;
//	uint32_t pcfgw_0;
//	uint32_t pcfgqos0_0;
//	uint32_t pcfgqos1_0;
//	uint32_t pcfgwqos0_0;
//	uint32_t pcfgwqos1_0;
//	uint32_t pcfgr_1;
//	uint32_t pcfgw_1;
//	uint32_t pcfgqos0_1;
//	uint32_t pcfgqos1_1;
//	uint32_t pcfgwqos0_1;
//	uint32_t pcfgwqos1_1;
//};
//
//struct stm32mp1_ddrphy_reg {
//	uint32_t pgcr;
//	uint32_t aciocr;
//	uint32_t dxccr;
//	uint32_t dsgcr;
//	uint32_t dcr;
//	uint32_t odtcr;
//	uint32_t zq0cr1;
//	uint32_t dx0gcr;
//	uint32_t dx1gcr;
//	uint32_t dx2gcr;
//	uint32_t dx3gcr;
//};
//
//struct stm32mp1_ddrphy_timing {
//	uint32_t ptr0;
//	uint32_t ptr1;
//	uint32_t ptr2;
//	uint32_t dtpr0;
//	uint32_t dtpr1;
//	uint32_t dtpr2;
//	uint32_t mr0;
//	uint32_t mr1;
//	uint32_t mr2;
//	uint32_t mr3;
//};

//struct stm32mp1_ddrphy_cal {
//	uint32_t dx0dllcr;
//	uint32_t dx0dqtr;
//	uint32_t dx0dqstr;
//	uint32_t dx1dllcr;
//	uint32_t dx1dqtr;
//	uint32_t dx1dqstr;
//	uint32_t dx2dllcr;
//	uint32_t dx2dqtr;
//	uint32_t dx2dqstr;
//	uint32_t dx3dllcr;
//	uint32_t dx3dqtr;
//	uint32_t dx3dqstr;
//};

struct stm32mp1_ddr_info {
	const char *name;
	uint32_t speed; /* in kHZ */
	uint32_t size;  /* Memory size in byte = col * row * width */
};

