ua1arn/hftrx/src/sdram/stm32mp1/stm32mp1_ddr_base.c
	/*
	 * 14. Perform MRS commands as required to re-program timing registers
	 *     in the SDRAM for the new frequency
	 *     (in particular, CL, CWL and WR may need to be changed).
	 */

	/* 15. Write DBG1.dis_hif = 0 to re-enable reads and writes. */
	mmio_clrbits_32((uintptr_t)&priv->ctl->dbg1, DDRCTRL_DBG1_DIS_HIF);
	VERBOSE("[%p] dbg1 = 0x%x\n",
		&priv->ctl->dbg1,
		(unsigned) mmio_read_32((uintptr_t)&priv->ctl->dbg1));
}

static void stm32mp1_refresh_disable(struct stm32mp1_ddrctl *ctl)
{
	stm32mp1_start_sw_done(ctl);
	/* Quasi-dynamic register update*/
	mmio_setbits_32((uintptr_t)&ctl->rfshctl3,
			DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);
	mmio_clrbits_32((uintptr_t)&ctl->pwrctl, DDRCTRL_PWRCTL_POWERDOWN_EN);
	mmio_clrbits_32((uintptr_t)&ctl->dfimisc,
			DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);
	stm32mp1_wait_sw_done_ack(ctl);
}

static void stm32mp1_refresh_restore(struct stm32mp1_ddrctl *ctl,
				     uint32_t rfshctl3, uint32_t pwrctl)
{
	stm32mp1_start_sw_done(ctl);
	if ((rfshctl3 & DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH) == 0U) {
		mmio_clrbits_32((uintptr_t)&ctl->rfshctl3,
				DDRCTRL_RFSHCTL3_DIS_AUTO_REFRESH);
	}
	if ((pwrctl & DDRCTRL_PWRCTL_POWERDOWN_EN) != 0U) {
		mmio_setbits_32((uintptr_t)&ctl->pwrctl,
				DDRCTRL_PWRCTL_POWERDOWN_EN);
	}
	mmio_setbits_32((uintptr_t)&ctl->dfimisc,
			DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);
	stm32mp1_wait_sw_done_ack(ctl);
}



static int board_ddr_power_init(enum ddr_type ddr_type)
{
#if WITHSDRAM_PMC1
	if (pmic_ddr_power_init(ddr_type))
		PRINTF("ddr power init failure\n");
#endif /* WITHSDRAM_PMC1 */
//	if (dt_pmic_status() > 0) {
//		return pmic_ddr_power_init(ddr_type);
//	}
	return 0;
}

//	The initialization steps for DDR3 SDRAMs are as follows:
//	1. Optionally maintain RESET# low for a minimum of either 200 us (power-up
//	initialization) or 100ns (power-on initialization).
//	The PUBL drives RESET# low from the beginning of reset assertion and therefore this
//	step may be skipped if enough time may already have expired to satisfy the RESET#
//	low time.
//	2. After RESET# is de-asserted, wait a minimum of 500 us with CKE low.
//	3. Apply NOP and drive CKE high.
//	4. Wait a minimum of tXPR
//	Caution: PUBL registers, SDRAM mode registers, and equivalent register fields inside
//	the memory controller must be uniformly programmed. Mismatches between the
//	register fields can cause transaction failures. Verify all register fields are consistently
//	programmed before starting any SDRAM transaction.
//	5. Issue a load Mode Register 2 (MR2) command.
//	6. Issue a load Mode Register 3 (MR3) command.
//	7. Issue a load Mode Register (MR1) command (to set parameters and enable DLL).
//	8. Issue a load Mode Register (MR0) command to set parameters and reset DLL.
//	9. Issue ZQ calibration command.
//	10. Wait 512 SDRAM clock cycles for the DLL to lock (tDLLK) and ZQ calibration (tZQinit)
//	to finish.
//	This wait time is relative to Step 8, i.e. relative to when the DLL reset command was
//	issued onto the SDRAM command bus.
static void stm32mp1_ddr_init_priv(struct ddr_info *priv,
	       struct stm32mp1_ddr_config_local *config)
{
	uint32_t pir;
	int ret = - 1;

	if ((config->c_reg.mstr & DDRCTRL_MSTR_DDR3) != 0U) {
		ret = board_ddr_power_init(STM32MP_DDR3);
	} else if ((config->c_reg.mstr & DDRCTRL_MSTR_LPDDR2) != 0U) {
		ret = board_ddr_power_init(STM32MP_LPDDR2);
	} else if ((config->c_reg.mstr & DDRCTRL_MSTR_LPDDR3) != 0U) {
		ret = board_ddr_power_init(STM32MP_LPDDR3);
	} else {
		ERROR("DDR type not supported\n");
	}

	if (ret != 0) {
		panic();
	}

#if WITHSDRAM_PMC1
	//stpmic1_dump_regulators();
#endif /* WITHSDRAM_PMC1 */

	VERBOSE("name = %s\n", config->info.name);
	VERBOSE("speed = %u kHz\n", (unsigned) config->info.speed);
	VERBOSE("size  = 0x%x\n", (unsigned) config->info.size);

	/* DDR INIT SEQUENCE */
	/*
	 * 1. Program the DWC_ddr_umctl2 registers
	 *     nota: check DFIMISC.dfi_init_complete = 0
	 */
	/* 1.1 RESETS: presetn, core_ddrc_rstn, aresetn */
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
	mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);

	/* 1.2. start CLOCK */
	if (stm32mp1_ddr_clk_enable_local(priv, config->info.speed) != 0) {
		panic();
	}

	/* 1.3. deassert reset */
	/* De-ASSERT PHY rstn and ctl_rstn via DPHYRST and DPHYCTLRST. */
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYRST);
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYCTLRST);
	/*
	 * De-ASSERT presetn once the clocks are active
	 * and stable via DDRCAPBRST bit.
	 */
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCAPBRST);

	/* 1.4. wait 128 cycles to permit initialization of end logic */
	local_delay_us(2 * 5);
	/* For PCLK = 133MHz => 1 us is enough, 2 to allow lower frequency */

	/* 1.5. initialize registers ddr_umctl2 */
	/* Stop uMCTL2 before PHY is ready */
	mmio_clrbits_32((uintptr_t)&priv->ctl->dfimisc,
			DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);
	VERBOSE("[%p] dfimisc = 0x%x\n",
		&priv->ctl->dfimisc,
		(unsigned) mmio_read_32((uintptr_t)&priv->ctl->dfimisc));

	set_reg(priv, rREG_REG, &config->c_reg);

	/* DDR3 = don't set DLLOFF for init mode */
	if ((config->c_reg.mstr &
	     (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE))
	    == (DDRCTRL_MSTR_DDR3 | DDRCTRL_MSTR_DLL_OFF_MODE)) {
		VERBOSE("deactivate DLL OFF in mstr\n");
		mmio_clrbits_32((uintptr_t)&priv->ctl->mstr,
				DDRCTRL_MSTR_DLL_OFF_MODE);
		VERBOSE("[%p] mstr = 0x%x\n",
			&priv->ctl->mstr,
			(unsigned) mmio_read_32((uintptr_t)&priv->ctl->mstr));
	}

	set_reg(priv, rREG_TIMING, &config->c_timing);
	set_reg(priv, rREG_MAP, &config->c_map);

	/* Skip CTRL init, SDRAM init is done by PHY PUBL */
	mmio_clrsetbits_32((uintptr_t)&priv->ctl->init0,
			   DDRCTRL_INIT0_SKIP_DRAM_INIT_MASK,
			   DDRCTRL_INIT0_SKIP_DRAM_INIT_NORMAL);
	VERBOSE("[%p] init0 = 0x%x\n",
		&priv->ctl->init0,
		(unsigned) mmio_read_32((uintptr_t)&priv->ctl->init0));

	set_reg(priv, rREG_PERF, &config->c_perf);

	/*  2. deassert reset signal core_ddrc_rstn, aresetn and presetn */
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCORERST);
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DDRCAXIRST);
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_DPHYAPBRST);

