ua1arn/hftrx/src/sdram/stm32mp1/stm32mp1_ddr_base.c
	if (1)
	{
		// TrustZone address space controller for DDR (TZC)

		// TZC AXI port 1 clocks enable
		RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_TZC1EN;
		(void) RCC->MP_APB5ENSETR;
		RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_TZC1LPEN;
		(void) RCC->MP_APB5LPENSETR;

		// TZC AXI port 2 clocks enable
		RCC->MP_APB5ENSETR = RCC_MP_APB5ENSETR_TZC2EN;
		(void) RCC->MP_APB5ENSETR;
		RCC->MP_APB5LPENSETR = RCC_MP_APB5LPENSETR_TZC2LPEN;
		(void) RCC->MP_APB5LPENSETR;

        // 0x01001F08
		// no_of_filters=1 - Two filter units.
		// address_width=31 - 32 bits.
		// no_of_regions=8 - Nine regions.
        //PRINTF("TZC->BUILD_CONFIG=%08lX\n", TZC->BUILD_CONFIG);
        //PRINTF("TZC->ACTION=%08lX\n", TZC->ACTION);
        //PRINTF("TZC->GATE_KEEPER=%08lX\n", TZC->GATE_KEEPER);

		TZC->ACTION = 0x00;
		(void) TZC->ACTION;
		const uint_fast8_t lastfilter = (TZC->BUILD_CONFIG >> 24) & 0x03;
		const uint_fast32_t mask = (1uL << (lastfilter + 1)) - 1;
		TZC->GATE_KEEPER = mask;	// Gate open request
		(void) TZC->GATE_KEEPER;
		// Check open status
		while (((TZC->GATE_KEEPER >> 16) & mask) != mask)
			;
		TZC->REG_ATTRIBUTESO |= 0xC0000000;	// All (read and write) permitted
		(void) TZC->REG_ATTRIBUTESO;
		TZC->REG_ID_ACCESSO = 0xFFFFFFFF; // NSAID_WR_EN[15:0], NSAID_RD_EN[15:0] - permits read and write non-secure to the region for all NSAIDs
		(void) TZC->REG_ID_ACCESSO;
        //PRINTF("TZC->REG_ID_ACCESSO=%08lX\n", TZC->REG_ID_ACCESSO);
        //PRINTF("TZC->REG_ATTRIBUTESO=%08lX\n", TZC->REG_ATTRIBUTESO);
	}
	if (1)
	{

        const uint_fast8_t lastregion = TZC->BUILD_CONFIG & 0x1f;
        uint_fast8_t i;
        for (i = 1; i <= lastregion; ++ i)
        {
            volatile uint32_t * const REG_ATTRIBUTESx = & TZC->REG_ATTRIBUTESO + (i * 8);
            volatile uint32_t * const REG_ID_ACCESSx = & TZC->REG_ID_ACCESSO + (i * 8);
            volatile uint32_t * const REG_BASE_LOWx = & TZC->REG_BASE_LOWO + (i * 8);
            volatile uint32_t * const REG_BASE_HIGHx = & TZC->REG_BASE_HIGHO + (i * 8);
            volatile uint32_t * const REG_TOP_LOWx = & TZC->REG_TOP_LOWO + (i * 8);
            volatile uint32_t * const REG_TOP_HIGHx = & TZC->REG_TOP_HIGHO + (i * 8);

            //PRINTF("TZC->REG_BASE_LOW%d=%08lX ", i, * REG_BASE_LOWx);
            //PRINTF("REG_BASE_HIGH%d=%08lX ", i, * REG_BASE_HIGHx);
            //PRINTF("REG_TOP_LOW%d=%08lX ", i, * REG_TOP_LOWx);
            //PRINTF("REG_TOP_HIGH%d=%08lX ", i, * REG_TOP_HIGHx);
            //PRINTF("REG_ATTRIBUTES%d=%08lX\n", i, * REG_ATTRIBUTESx);
            //PRINTF("REG_ID_ACCESS%d=%08lX\n", i, * REG_ID_ACCESSx);

             * REG_ATTRIBUTESx &= ~ 0x03uL;

            //PRINTF("TZC->REG_ATTRIBUTES%d=%08lX\n", i, * REG_ATTRIBUTESx);
        }
	}
	if (0)
	{
		/* SYSCFG clock enable */
		RCC->MP_APB3ENSETR = RCC_MP_APB3ENSETR_SYSCFGEN;
		(void) RCC->MP_APB3ENSETR;
		RCC->MP_APB3LPENSETR = RCC_MP_APB3LPENSETR_SYSCFGLPEN;
		(void) RCC->MP_APB3LPENSETR;
		/*
		 * Interconnect update : select master using the port 1.
		 * MCU interconnect (OTG_HS) = AXI_M0.
		 */
//		SYSCFG->ICNR |= SYSCFG_ICNR_AXI_M0;
//		(void) SYSCFG->ICNR;
	}

	priv->ctl = (struct stm32mp1_ddrctl *) DDRCTRL_BASE;
	priv->phy = (struct stm32mp1_ddrphy *) DDRPHYC_BASE;
	priv->pwr = PWR_BASE;
	priv->rcc = RCC_BASE;
	priv->info.base = STM32MP_DDR_BASE;
	priv->info.size = DDR_MEM_SIZE;

	stm32mp1_ddr_get_config_local(& config);

	/* Software Self-Refresh mode (SSR) during DDR initilialization */
	mmio_clrsetbits_32((uintptr_t) & RCC->DDRITFCR,
			   RCC_DDRITFCR_DDRCKMOD_Msk,
			   (0) << RCC_DDRITFCR_DDRCKMOD_Pos); // RCC_DDRITFCR_DDRCKMOD_SSR

#if 0
	/* Disable axidcg clock gating during init */
	mmio_clrbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

	stm32mp1_ddr_init_priv(priv, & config);

	/* Enable axidcg clock gating */
	//mmio_setbits_32((uintptr_t) & RCC->DDRITFCR, RCC_DDRITFCR_AXIDCGEN);

	uret = ddr_test_data_bus();
	if (uret != 0U) {
		ERROR("DDR data bus test: can't access memory @ 0x%x\n",
		      uret);
		//panic();
	}
	uret = ddr_test_addr_bus();
	if (uret != 0U) {
		ERROR("DDR addr bus test: can't access memory @ 0x%x\n",
		      uret);
		//panic();
	}

	uret = ddr_check_size();
	if (uret < config.info.size) {
		ERROR("DDR size: 0x%x does not match DT config: 0x%x\n",
		      uret, (unsigned) config.info.size);
		//panic();
	}
	INFO("2 Memory size = 0x%x (%u MB)\n", (unsigned) uret, (unsigned) (uret / (1024U * 1024U)));
#else
	stm32mp1_ddr_probe();
#endif

#if 0
	// Бесконечный тест памяти.
	PRINTF("DDR memory tests:\n");
#if defined (BOARD_BLINK_INITIALIZE)
	BOARD_BLINK_INITIALIZE();
#endif /* defined (BOARD_BLINK_INITIALIZE) */

	//for (;;)
	{
		PRINTF("rand_val = %08lX ", (unsigned long) rand_val);

		uret = ddr_test_data_bus();
		if (uret != 0U) {
			ERROR("DDR data bus test: can't access memory @ 0x%08x\n",
			      uret);
			panic();
		}
		uret = ddr_test_addr_bus();
		if (uret != 0U) {
			ERROR("DDR addr bus test: can't access memory @ 0x%08x\n",
			      uret);
			panic();
		}
		uret = ddr_check_size();
		if (uret != config.info.size) {
			ERROR("DDR size: 0x%x does not match DT config: 0x%08x\n",
			      uret, config.info.size);
			panic();
		}
		int partfortest = 128;
		uret = ddr_check_rand(config.info.size / partfortest);
		if (uret != (config.info.size / partfortest)) {
			ERROR("DDR random test: 0x%08x does not match DT config: 0x%08x\n",
			      uret, config.info.size / partfortest);
			panic();
		}
		PRINTF(".");
		//char c;
		//if (dbg_getchar(& c)/* && c == 0x1b*/)
		//	break;
	}
#endif
	//__set_SCTLR(__get_SCTLR() | SCTLR_C_Msk);
	//PRINTF("TZC->INT_STATUS=%08lX\n", TZC->INT_STATUS);

#if WITHDEBUG && 0
	{
		unsigned size4 = config.info.size / 4;
		volatile uint32_t * base4 = (volatile uint32_t *) STM32MP_DDR_BASE;
		while (size4 --)
			* base4 ++ = 0xABBA1998uL;
	}
#endif /* WITHDEBUG */

	/* Software Self-Refresh mode (SSR) during DDR initilialization */
//	mmio_clrsetbits_32((uintptr_t) & RCC->DDRITFCR,
//			   RCC_DDRITFCR_DDRCKMOD_Msk,
//			   (0) << RCC_DDRITFCR_DDRCKMOD_Pos);

	PRINTF("arm_hardware_sdram_initialize done\n");

	return 0;
}

#endif /* WITHSDRAMHW && CPUSTYLE_STM32MP1 */
